CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПравилаОбработкиДанных/ПравилаОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаОбработкиДанных</name>
  <basedOn>Catalog.ПравилаКонвертацииОбъектов</basedOn>
  <attributes>
    <name>АлгоритмВыборкаДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередОбработкой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВыборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКонвертацииОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертацииОбъектов</name>
    <attributes>
      <name>ПравилоКонвертацииОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПравилаОбработкиДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		ЭтотОбъект.Группа = ДанныеЗаполнения.Группа;
		Если ДанныеЗаполнения.ИспользоватьДляОтправки Тогда
			ЭтотОбъект.ИспользоватьДляОтправки = Истина;
			ЭтотОбъект.ОбъектВыборки = ДанныеЗаполнения.ОбъектКонфигурации;
		Иначе
			ЭтотОбъект.ИспользоватьДляПолучения = Истина;
			ЭтотОбъект.ОбъектВыборки = ДанныеЗаполнения.ОбъектФормата;
		КонецЕсли;
		ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.ОбъектВыборки);
		ЭтотОбъект.ПравилоКонвертацииОбъекта = ДанныеЗаполнения.Код;
		
		ЗаполнитьСписокКонвертацийНовогоОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(АлгоритмВыборкаДанных) И НЕ ИспользоватьДляОтправки Тогда
		АлгоритмВыборкаДанных = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка) 
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		КонвертацияДанныхXDTOВызовСервера.ОбработатьПометкуНаУдалениеЭлементаКонвертации(Ссылка, ПометкаУдаления);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьСписокКонвертацийНовогоОбъекта(НовыйОбъект, ДанныеЗаполнения)
	СписокКонвертаций = Новый СписокЗначений();
	КонвертацияДанныхXDTOВызовСервера.ПолучитьСписокКонвертацийДляЭлементаКонвертации(ДанныеЗаполнения, СписокКонвертаций);
	
	СсылкаНового = НовыйОбъект.ПолучитьСсылкуНового();
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(СсылкаНового, СписокКонвертаций);
КонецПроцедуры
#КонецОбласти
#КонецЕсли
